ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbClient.cpp
    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC24_UsbClient_Uninitialize(controller);

    State->Initialized = false;

    // for soft reboot allow the USB to be off for at least 100ms
    LPC24_Time_Delay(nullptr, 100000); // 100ms

    return true;
}

bool UsbClient_Driver::OpenPipe(int controller, int32_t& usbPipe, TinyCLR_UsbClient_PipeMode mode) {
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || !State->Initialized)     // If no such controller exists (or it is not initialized)
        return false;

    int32_t writeEp = USB_NULL_ENDPOINT;
    int32_t readEp = USB_NULL_ENDPOINT;

    switch (mode) {
    case TinyCLR_UsbClient_PipeMode::In:
        // TODO
        return false;

    case TinyCLR_UsbClient_PipeMode::Out:
        // TODO
        return false;

    case TinyCLR_UsbClient_PipeMode::InOut:

        for (auto i = 0; i < SIZEOF_ARRAY(LPC24_UsbClient_EndpointMap); i++) {
            if ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_INUSED_MASK)) // in used
                continue;

            if (writeEp == USB_NULL_ENDPOINT && ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_DIR_IN_MASK) == ENDPOINT_DIR_IN_MASK)) {
                writeEp = i;
                LPC24_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

                continue;
            }

            if (readEp == USB_NULL_ENDPOINT && ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_DIR_OUT_MASK) == ENDPOINT_DIR_OUT_MASK)) {
                readEp = i;
                LPC24_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

                continue;
            }

            if (writeEp != 0 && readEp != 0) {
                break;
            }
        }
        // Check the usbPipe and the two endpoint numbers for validity (both endpoints cannot be zero)
        if ((readEp == USB_NULL_ENDPOINT && writeEp == USB_NULL_ENDPOINT)
            || (readEp != USB_NULL_ENDPOINT && (readEp < 1 || readEp >= LPC24_USB_QUEUE_SIZE))
            || (writeEp != USB_NULL_ENDPOINT && (writeEp < 1 || writeEp >= LPC24_USB_QUEUE_SIZE)))
            return false;

        // The specified endpoints must not be in use by another pipe
        for (int pipe = 0; pipe < LPC24_USB_QUEUE_SIZE; pipe++) {
            if (readEp != USB_NULL_ENDPOINT && (State->pipes[pipe].RxEP == readEp || State->pipes[pipe].TxEP == readEp))
                return false;
            if (writeEp != USB_NULL_ENDPOINT && (State->pipes[pipe].RxEP == writeEp || State->pipes[pipe].TxEP == writeEp))
                return false;
        }

        for (usbPipe = 0; usbPipe < LPC24_USB_QUEUE_SIZE; usbPipe++) {
            // The Pipe must be currently closed
            if (State->pipes[usbPipe].RxEP == USB_NULL_ENDPOINT && State->pipes[usbPipe].TxEP == USB_NULL_ENDPOINT)
                break;
        }

        if (usbPipe == LPC24_USB_QUEUE_SIZE)
            return false; // full endpoint

        // All tests pass, assign the endpoints to the pipe
        State->pipes[usbPipe].RxEP = readEp;
        State->pipes[usbPipe].TxEP = writeEp;

        TinyCLR_UsbClient_ConfigurationDescriptor *config = (TinyCLR_UsbClient_ConfigurationDescriptor *)UsbDefaultConfiguration.config;
        TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)config) + USB_CONFIGURATION_DESCRIPTOR_LENGTH + sizeof(TinyCLR_UsbClient_DescriptorHeader) + sizeof(TinyCLR_UsbClient_InterfaceDescriptor));

        uint8_t * end = ((uint8_t *)config) + config->header.size;

        while (((uint8_t *)ep) != nullptr && ((uint8_t *)ep) < end) {
            if (USB_ENDPOINT_DESCRIPTOR_TYPE != ep->bDescriptorType || sizeof(TinyCLR_UsbClient_EndpointDescriptor) != ep->bLength)
                break;

            auto idx = 0;

            if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_IN) {
                ep->bEndpointAddress |= writeEp;
                idx = writeEp;
                State->IsTxQueue[idx] = true;
            }
            else if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_OUT) {
                ep->bEndpointAddress |= readEp;
                idx = readEp;
                State->IsTxQueue[idx] = false;
            }

            if (idx > 0) {
                if (apiProvider != nullptr) {
                    auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

                    State->Queues[idx] = (USB_PACKET64*)memoryProvider->Allocate(memoryProvider, LPC24_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));

                    if (State->Queues[idx] == nullptr)
                        return false;

                    memset(reinterpret_cast<uint8_t*>(State->Queues[idx]), 0x00, LPC24_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));
                }

                usb_fifo_buffer_in[idx] = usb_fifo_buffer_out[idx] = usb_fifo_buffer_count[idx] = 0;


                State->MaxPacketSize[idx] = ep->wMaxPacketSize;
            }

            ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)ep) + ep->bLength);
        }


        break;
    }

    if (State->CurrentState == USB_DEVICE_STATE_UNINITIALIZED) {
        LPC24_UsbClient_Initialize(controller);
    }
    else if (State->Configured) {
        LPC24_UsbClient_SoftReset(controller);
    }

    State->Configured = true;

    return true;
}

bool UsbClient_Driver::ClosePipe(int controller, int usbPipe) {
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || !State->Initialized || usbPipe >= LPC24_USB_QUEUE_SIZE)
        return false;

    int endpoint;
    DISABLE_INTERRUPTS_SCOPED(irq);

    // Close the Rx pipe
    endpoint = State->pipes[usbPipe].RxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint]) {
        usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;
    }

    State->pipes[usbPipe].RxEP = USB_NULL_ENDPOINT;
    //Free endpoint
    LPC24_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    // Close the TX pipe
    endpoint = State->pipes[usbPipe].TxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint] != nullptr) {
        usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;

