ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbClient.cpp
            }

            if (!Packet64) {
                UsbClient_Driver::ClearEvent(controller, 1 << endpoint);
                break;
            }

            max_move = Packet64->Size - State->CurrentPacketOffset[endpoint];
            if (remain < max_move) max_move = remain;

            memcpy(ptr, &Packet64->Buffer[State->CurrentPacketOffset[endpoint]], max_move);

            State->CurrentPacketOffset[endpoint] += max_move;
            ptr += max_move;
            count += max_move;
            remain -= max_move;

            /* if we're done with this packet, move onto the next */
            if (State->CurrentPacketOffset[endpoint] == Packet64->Size) {
                State->CurrentPacketOffset[endpoint] = 0;
                Packet64 = nullptr;

                LPC24_UsbClient_RxEnable(State, endpoint);
            }
        }

        return count;
    }
}

bool UsbClient_Driver::Flush(int controller, int usbPipe) {
    int endpoint;
    int retries = USB_FLUSH_RETRY_COUNT;
    int queueCnt;
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || usbPipe >= LPC24_USB_QUEUE_SIZE) {
        return false;
    }

    /* not configured, no data can go in or out */
    if (State->DeviceState != USB_DEVICE_STATE_CONFIGURED) {
        return true;
    }

    endpoint = State->pipes[usbPipe].TxEP;
    // If no Write side to pipe (or if not yet open)
    if (endpoint == USB_NULL_ENDPOINT || State->Queues[endpoint] == nullptr) {
        return false;
    }

    queueCnt = usb_fifo_buffer_count[endpoint];

    // interrupts were disabled or USB interrupt was disabled for whatever reason, so force the flush
    while (usb_fifo_buffer_count[endpoint] > 0 && retries > 0) {
        LPC24_UsbClient_StartOutput(State, endpoint);

        int cnt = usb_fifo_buffer_count[endpoint];

        if (queueCnt == cnt)
            LPC24_Time_Delay(nullptr, 100); // don't call Events_WaitForEventsXXX because it will turn off interrupts

        retries = (queueCnt == cnt) ? retries - 1 : USB_FLUSH_RETRY_COUNT;

        queueCnt = cnt;
    }

    if (retries <= 0)
        usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;

    return true;
}

uint32_t UsbClient_Driver::SetEvent(int controller, uint32_t Event) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    USB_CONTROLLER_STATE *State = &UsbControllerState[controller];

    if (State == nullptr)
        return 0;

    uint32_t OldEvent = State->Event;

    State->Event |= Event;

    if (OldEvent != State->Event) {
        UsbClient_Driver::DataReceivedHandler(nullptr);
    }

    //printf("SetEv %d\r\n",State->Event);
    return OldEvent;
}

uint32_t UsbClient_Driver::ClearEvent(int controller, uint32_t Event) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    USB_CONTROLLER_STATE *State = &UsbControllerState[controller];

    if (State == nullptr)
        return 0;

    uint32_t OldEvent = State->Event;

    State->Event &= ~Event;

    return OldEvent;
}

void USB_ClearQueues(USB_CONTROLLER_STATE *State, bool ClrRxQueue, bool ClrTxQueue) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    if (ClrRxQueue) {
        for (int endpoint = 0; endpoint < LPC24_USB_QUEUE_SIZE; endpoint++) {
            if (State->Queues[endpoint] == nullptr || State->IsTxQueue[endpoint])
                continue;

            usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;

            /* since this queue is now reset, we have room available for newly arrived packets */
            LPC24_UsbClient_RxEnable(State, endpoint);
        }
    }

    if (ClrTxQueue) {
        for (int endpoint = 0; endpoint < LPC24_USB_QUEUE_SIZE; endpoint++) {
            if (State->Queues[endpoint] && State->IsTxQueue[endpoint])
                usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;
        }
    }
}

void LPC24_UsbClient_StateCallback(USB_CONTROLLER_STATE* State) {
    if (State->CurrentState != State->DeviceState) {
        /* whenever we leave the configured state, re-initialize all of the queues */
//Not necessary, as TxBuffer may hold any data and then send them out when it is configured again.
// The RxQueue is clear when it is configured.

        if (USB_DEVICE_STATE_CONFIGURED == State->CurrentState) {
            USB_ClearQueues(State, true, true);
        }

        State->CurrentState = State->DeviceState;

        switch (State->DeviceState) {
        case USB_DEVICE_STATE_DETACHED:
            State->ResidualCount = 0;
            State->DataCallback = nullptr;
            //            hal_printf("USB_DEVICE_STATE_DETACHED\r\n");
            break;

        case USB_DEVICE_STATE_ATTACHED:
            //            hal_printf("USB_DEVICE_STATE_ATTACHED\r\n");
            break;

        case USB_DEVICE_STATE_POWERED:
            //            hal_printf("USB_DEVICE_STATE_POWERED\r\n");
            break;

        case USB_DEVICE_STATE_DEFAULT:
            //            hal_printf("USB_DEVICE_STATE_DEFAULT\r\n");
            break;

        case USB_DEVICE_STATE_ADDRESS:
            //            hal_printf("USB_DEVICE_STATE_ADDRESS\r\n");
            break;

        case USB_DEVICE_STATE_CONFIGURED:
            //            hal_printf("USB_DEVICE_STATE_CONFIGURED\r\n");

                        /* whenever we enter the configured state, re-initialize all of the RxQueues */
                        /* Txqueue has stored some data to be transmitted */
            USB_ClearQueues(State, true, false);
            break;

        case USB_DEVICE_STATE_SUSPENDED:
            //            hal_printf("USB_DEVICE_STATE_SUSPENDED\r\n");
            break;

        default:
            USB_DEBUG_ASSERT(0);
            break;
        }
    }
}

void USB_DataCallback(USB_CONTROLLER_STATE* State) {
    uint32_t length = __min(State->PacketSize, State->ResidualCount);

    memcpy(State->Data, State->ResidualData, length);

    State->DataSize = length;
    State->ResidualData += length;
    State->ResidualCount -= length;

