ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbClient.cpp
/* Error Code Register Definitions */
#define ERR_EC_MASK         0x0F
#define ERR_EA              0x10

/* Error Status Register Definitions */
#define ERR_PID             0x01
#define ERR_UEPKT           0x02
#define ERR_DCRC            0x04
#define ERR_TIMOUT          0x08
#define ERR_EOP             0x10
#define ERR_B_OVRN          0x20
#define ERR_BTSTF           0x40
#define ERR_TGL             0x80

/* Endpoint Select Register Definitions */
#define EP_SEL_F            0x01
#define EP_SEL_ST           0x02
#define EP_SEL_STP          0x04
#define EP_SEL_PO           0x08
#define EP_SEL_EPN          0x10
#define EP_SEL_B_1_FULL     0x20
#define EP_SEL_B_2_FULL     0x40

/* Endpoint Status Register Definitions */
#define EP_STAT_ST          0x01
#define EP_STAT_DA          0x20
#define EP_STAT_RF_MO       0x40
#define EP_STAT_CND_ST      0x80

/* Clear Buffer Register Definitions */
#define CLR_BUF_PO          0x01


/* DMA Interrupt Bit Definitions */
#define EOT_INT             0x01
#define NDD_REQ_INT         0x02
#define SYS_ERR_INT         0x04

struct LPC24_USB_Driver {
    static const uint32_t c_Used_Endpoints = LPC24_USB_QUEUE_SIZE;
    static const uint32_t c_default_ctrl_packet_size = 64;

    USB_CONTROLLER_STATE*   pUsbControllerState;

#if defined(USB_REMOTE_WAKEUP)
#define USB_MAX_REMOTE_WKUP_RETRY 5

    HAL_COMPLETION          RemoteWKUP10msCompletion;
    HAL_COMPLETION          RemoteWKUP100msEOPCompletion;
    uint32_t                  RemoteWkUpRetry;
#endif

    uint8_t                   ControlPacketBuffer[c_default_ctrl_packet_size];
    uint16_t                  EndpointStatus[c_Used_Endpoints];
    bool                    TxRunning[c_Used_Endpoints];
    bool                    TxNeedZLPS[c_Used_Endpoints];

    uint8_t                   PreviousDeviceState;
    uint8_t                   RxExpectedToggle[c_Used_Endpoints];
    bool                    PinsProtected;
    bool                    FirstDescriptorPacket;

#if defined(USB_METRIC_COUNTING)
    USB_PERFORMANCE_METRICS PerfMetrics;
#endif

    //--//

    static USB_CONTROLLER_STATE * GetState(int Controller);

    static bool Initialize(int Controller);

    static bool Uninitialize(int Controller);

    static bool StartOutput(USB_CONTROLLER_STATE* State, int endpoint);

    static bool RxEnable(USB_CONTROLLER_STATE* State, int endpoint);

    static bool GetInterruptState();

    static bool ProtectPins(int Controller, bool On);

    //private:

    static void ProcessEP0(int in, int setup);
    static void ProcessEndPoint(int ep, int in);

    static void ClearTxQueue(USB_CONTROLLER_STATE* State, int endpoint);

    static void StartHardware();

    static void StopHardware();

    static void TxPacket(USB_CONTROLLER_STATE* State, int endpoint);

    static void ControlNext();

    static void SuspendEvent();
    static void ResumeEvent();
    static void ResetEvent();

    static void Global_ISR(void*  Param);
    static void EP0_ISR(uint32_t Param);
    static void EP_TxISR(uint32_t Param);
    static void EP_RxISR(uint32_t Param);


#if defined(USB_REMOTE_WAKEUP)
    static void RemoteWkUp_ISR(void* Param);
    static void RemoteWkUp_Process(void* Param);
#endif
};

extern LPC24_USB_Driver g_LPC24_USB_Driver;

union EndpointConfiguration {
    struct {
        unsigned EE : 1;      // Endpoint enable (1 = enable)
        unsigned DE : 1;      // Double buffer enable (1 = double buffered)
        unsigned MPS : 10;      // Maximum packet size (iso=1-1023, blk=8,16,32,64, int=1-64
        unsigned ED : 1;      // Endpoint direction (1 = IN)
        unsigned ET : 2;      // Endpoint type (1=iso, 2=blk, 3=int)
        unsigned EN : 4;      // Endpoint number (1-15)
        unsigned AISN : 3;      // Alternate Interface number
        unsigned IN : 3;      // Interface number
        unsigned CN : 2;      // Configuration number
    } bits;
    uint32_t word;
};

LPC24_USB_Driver g_LPC24_USB_Driver;


bool LPC24_UsbClient_Initialize(int controller) {
    if ((uint32_t)controller >= TOTAL_USB_CONTROLLER)
        return false;

    return LPC24_USB_Driver::Initialize(controller);
}

bool LPC24_UsbClient_Uninitialize(int controller) {
    return LPC24_USB_Driver::Uninitialize(controller);
}

bool LPC24_UsbClient_StartOutput(USB_CONTROLLER_STATE* State, int ep) {

    return LPC24_USB_Driver::StartOutput(State, ep);
}

bool LPC24_UsbClient_RxEnable(USB_CONTROLLER_STATE* State, int ep) {

    return LPC24_USB_Driver::RxEnable(State, ep);
}

// Specific driver

//EP Types:
#define GHI_EP_TYPE_CONTROL 0
#define GHI_EP_TYPE_ISO     1
#define GHI_EP_TYPE_BULK    2
#define GHI_EP_TYPE_INT     3

// LPC datasheet
const char EP_Type_Table[16] =
{
GHI_EP_TYPE_CONTROL,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_BULK,
};

bool _appendZP = true;

USB_CONTROLLER_STATE UsbControllerState[1];     // Only 1 USB Controller for this device

//Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[LPC24_USB_Driver::c_Used_Endpoints-1];

static EndpointConfiguration EndpointInit[LPC24_USB_Driver::c_Used_Endpoints];     // Corresponds to endpoint configuration RAM at LPC24_USB::UDCCRx

///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////Gus added USB functions////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
static uint8_t  USB_DeviceAddress = 0;
static int nacking_rx_OUT_data[LPC24_USB_Driver::c_Used_Endpoints];
#define CONTORL_EP_ADDR	0x80

#define USB_POWER           0
//#define USB_IF_NUM          4
#define USB_EP_NUM          32
#define USB_MAX_PACKET0     64
#define USB_DMA             0
#define USB_DMA_EP          0x00000000

#define USB_POWER_EVENT     0
#define USB_RESET_EVENT     1
#define USB_WAKEUP_EVENT    0
#define USB_SOF_EVENT       0
#define USB_ERROR_EVENT     0
#define USB_EP_EVENT        0x0003
#define USB_CONFIGURE_EVENT 1
#define USB_INTERFACE_EVENT 0
#define USB_FEATURE_EVENT   0

