ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbClient.cpp
    g_LPC24_USB_Driver.pUsbControllerState = &State;
    g_LPC24_USB_Driver.PinsProtected = true;

    State.EndpointStatus = &g_LPC24_USB_Driver.EndpointStatus[0];
    State.EndpointCount = c_Used_Endpoints;
    State.PacketSize = c_default_ctrl_packet_size;

    State.FirstGetDescriptor = true;

    ProtectPins(Controller, false);

    return true;
}

bool LPC24_USB_Driver::Uninitialize(int Controller) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    ProtectPins(Controller, true);

    g_LPC24_USB_Driver.pUsbControllerState = nullptr;

    //LPC24_Interrupt_Deactivate( LPC24_AITC::c_IRQ_INDEX_USB_CLIENT );
    LPC24_Interrupt_Deactivate(USB_IRQn);

    memset(UsbControllerState, 0, sizeof(USB_CONTROLLER_STATE));

    return true;
}
//volatile int test_flag = 1;
bool LPC24_USB_Driver::StartOutput(USB_CONTROLLER_STATE* State, int endpoint) {
    int32_t m, n, val;


    DISABLE_INTERRUPTS_SCOPED(irq);

    /* if the halt feature for this endpoint is set, then just
       clear all the characters */
    if (State->EndpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        ClearTxQueue(State, endpoint);
        return true;
    }

    //If TxRunning, interrupts will drain the queue
    if (!g_LPC24_USB_Driver.TxRunning[endpoint]) {
        g_LPC24_USB_Driver.TxRunning[endpoint] = true;

        // Calling both TxPacket & EP_TxISR in this routine could cause a TX FIFO overflow
        TxPacket(State, endpoint);
    }
    else if (irq.WasDisabled()) {

        n = EPAdr(endpoint, 1); // It is an output endpoint for sure
        if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
        {
            m = n >> 1;


            if (m == 0)//EP0
            {
                USBEpIntClr = 1 << n;
                while ((USBDevIntSt & CDFULL_INT) == 0);
                val = USBCmdData;

                if (val & EP_SEL_STP)        /* Setup Packet */
                {
                    ProcessEP0(0, 1);// out setup
                }
                else {
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        ProcessEP0(0, 0);// out not setup
                    }
                    else {
                        ProcessEP0(1, 0);// in not setup
                    }
                }


            }
            else {
                if (State->Queues[m] && State->IsTxQueue[endpoint])
                    ProcessEndPoint(m, 1);//out
                else
                    ProcessEndPoint(m, 0);//in
            }

        }



    }

    return true;
}

bool LPC24_USB_Driver::GetInterruptState() {
    return true;/////////////////////////////////////////////////
}

//--//

void LPC24_USB_Driver::ClearTxQueue(USB_CONTROLLER_STATE* State, int endpoint) {
    usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;
}


bool LPC24_UsbClient_SoftReset(int controller) {
    LPC24_Interrupt_Activate(USB_IRQn, (uint32_t*)&LPC24_USB_Driver::Global_ISR, 0);

    return true;
}
//--//

void LPC24_USB_Driver::StartHardware() {
    *(uint32_t*)0xE01FC0C4 |= 0x80000000;
    USBClkCtrl = (1 << 1) | (1 << 3) | (1 << 4);

    LPC24_UsbClient_PinConfiguration();

    USB_Reset();
    USB_SetAddress(0);

    USBDevIntEn = DEV_STAT_INT;	/* Enable Device Status Interrupt */

    USB_Connect(false);
    // delay if removed and then connected...
    LPC24_Time_Delay(nullptr, 120 * 1000);

    USB_Connect(true);

}

void LPC24_USB_Driver::StopHardware() {
    USB_Connect(false);
}

void LPC24_USB_Driver::TxPacket(USB_CONTROLLER_STATE* State, int endpoint) {

    DISABLE_INTERRUPTS_SCOPED(irq);

    // transmit a packet on UsbPortNum, if there are no more packets to transmit, then die
    USB_PACKET64* Packet64;

    for (;;) {
        Packet64 = LPC24_UsbClient_TxDequeue(State, endpoint);

        if (Packet64 == nullptr || Packet64->Size > 0) {
            break;
        }

    }

    if (Packet64) {

        USB_WriteEP(endpoint, Packet64->Buffer, Packet64->Size);

        g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = false;
        if (Packet64->Size == 64 && _appendZP)
            g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = true;
    }
    else {
        // send the zero length packet since we landed on the FIFO boundary before
        // (and we queued a zero length packet to transmit)
        if (g_LPC24_USB_Driver.TxNeedZLPS[endpoint]) {
            USB_WriteEP(endpoint, (uint8_t*)nullptr, 0);
            g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = false;
        }

        // no more data
        g_LPC24_USB_Driver.TxRunning[endpoint] = false;
    }


}
void LPC24_USB_Driver::ControlNext() {

    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    if (State->DataCallback) {
        // this call can't fail
        State->DataCallback(State);

        if (State->DataSize == 0) {
            USB_WriteEP(CONTORL_EP_ADDR, (uint8_t*)nullptr, 0);
            State->DataCallback = nullptr;                         // Stop sending stuff if we're done
        }
        else {

            USB_WriteEP(CONTORL_EP_ADDR, State->Data, State->DataSize);

            if (State->DataSize < c_default_ctrl_packet_size)    // If packet is less than full length
            {
                State->DataCallback = nullptr;                     // Stop sending stuff if we're done
            }


            // special handling the USB driver set address test, cannot use the first descriptor as the ADDRESS state is handle in the hardware
            if (g_LPC24_USB_Driver.FirstDescriptorPacket) {
                State->DataCallback = nullptr;
            }

        }
    }
}

void LPC24_USB_Driver::Global_ISR(void* Param) {
    // we had a weird behavior without this here when disconnectin/connecting USB cable
    DISABLE_INTERRUPTS_SCOPED(irq);

    int32_t disr, val, n, m;

    //for (volatile int ii = 0; ii < 0xFF; ii++);

    disr = USBDevIntSt;                      /* Device Interrupt Status */
    USBDevIntClr = disr;                       /* A known issue on LPC214x */

    if (disr & DEV_STAT_INT) {
        //DeviceInterruptCount++;

