ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbClient.cpp
}

void LPC24_USB_Driver::EP_TxISR(uint32_t endpoint) {
    uint32_t EP_INTR;
    int val;

    if (USBEpIntSt & (1 << EPAdr(endpoint, 1)))//done sending?
    {
        //clear interrupt flag
        USBEpIntClr = 1 << EPAdr(endpoint, 1);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;

        // successfully transmitted packet, time to send the next one
        TxPacket(g_LPC24_USB_Driver.pUsbControllerState, endpoint);
    }

}

void LPC24_USB_Driver::EP_RxISR(uint32_t endpoint) {
    bool          DisableRx;

    USB_PACKET64* Packet64 = LPC24_UsbClient_RxEnqueue(g_LPC24_USB_Driver.pUsbControllerState, endpoint, DisableRx);

    /* copy packet in, making sure that Packet64->Buffer is never overflowed */



    if (Packet64) {
        uint8_t   len = 0;//USB.UDCBCRx[EPno] & LPC24_USB::UDCBCR_mask;
        uint32_t* packetBuffer = (uint32_t*)Packet64->Buffer;
        len = USB_ReadEP(endpoint, Packet64->Buffer);

        // clear packet status
        nacking_rx_OUT_data[endpoint] = 0;
        Packet64->Size = len;
    }
    else {
        /* flow control should absolutely protect us from ever
        getting here, so if we do, it is a bug */
        nacking_rx_OUT_data[endpoint] = 1;//we will need to triger next interrupt

    }

}

void LPC24_USB_Driver::SuspendEvent() {
    //LPC24_USB& USB = LPC24::USB();
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side

    g_LPC24_USB_Driver.PreviousDeviceState = State->DeviceState;

    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;

    LPC24_UsbClient_StateCallback(State);
}


void LPC24_USB_Driver::ResumeEvent() {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    State->DeviceState = g_LPC24_USB_Driver.PreviousDeviceState;

    LPC24_UsbClient_StateCallback(State);

}



void LPC24_USB_Driver::ResetEvent() {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    USB_Reset();
    USB_DeviceAddress = 0;

    // clear all flags
    UsbClient_Driver::ClearEvent(0, 0xFFFFFFFF);

    for (int ep = 0; ep < c_Used_Endpoints; ep++) {
        g_LPC24_USB_Driver.TxRunning[ep] = false;
        g_LPC24_USB_Driver.TxNeedZLPS[ep] = false;
    }

    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    State->Address = 0;
    LPC24_UsbClient_StateCallback(State);

}

//--//

bool LPC24_USB_Driver::RxEnable(USB_CONTROLLER_STATE *State, int endpoint) {
    if (nullptr == State || endpoint >= c_Used_Endpoints)
        return false;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (nacking_rx_OUT_data[endpoint])
        EP_RxISR(endpoint);//force interrupt to read the pending EP

    return true;
}

bool LPC24_USB_Driver::ProtectPins(int Controller, bool On) {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // Initialized yet?
    if (State) {
        if (On) {
            if (!g_LPC24_USB_Driver.PinsProtected) {
                // Disable the USB com, state change from Not protected to Protected
                g_LPC24_USB_Driver.PinsProtected = true;

                USB_Reset();
                USB_DeviceAddress = 0;

                StopHardware();
            }
        }
        else {
            if (g_LPC24_USB_Driver.PinsProtected) {
                // Ready for USB to enable, state change from Protected to Not protected
                g_LPC24_USB_Driver.PinsProtected = false;

                // enable the clock,
                // set USB to attached/powered
                // set the device to a known state- Attached before it is set to the powered state (USB specf 9.1.1)
                //CPU_GPIO_EnableInputPin(LPC24_USB::c_USBC_GPION_DET, false, nullptr, GPIO_INT_NONE, RESISTOR_DISABLED);
                //CPU_GPIO_EnableOutputPin(LPC24_USB::c_USBC_GPIOX_EN, false);       // Don't signal the host yet
                State->DeviceState = USB_DEVICE_STATE_ATTACHED;

                LPC24_UsbClient_StateCallback(State);

                StartHardware();
            }
        }

        return true;
    }
    else {
        return false;
    }
}

